Test/Output/run/workload a/hbase10_workloada_12000_run_020518.txt
[OVERALL], RunTime(ms), 6679.0
[OVERALL], Throughput(ops/sec), 1796.6761491241205
[TOTAL_GCS_PS_Scavenge], Count, 7.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 64.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.9582272795328642
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7.0
[TOTAL_GC_TIME], Time(ms), 64.0
[TOTAL_GC_TIME_%], Time(%), 0.9582272795328642
[READ], Operations, 5949.0
[READ], AverageLatency(us), 334.75323583795597
[READ], MinLatency(us), 150.0
[READ], MaxLatency(us), 73919.0
[READ], 95thPercentileLatency(us), 472.0
[READ], 99thPercentileLatency(us), 1742.0
[READ], Return=OK, 5949
[CLEANUP], Operations, 2.0
[CLEANUP], AverageLatency(us), 76328.0
[CLEANUP], MinLatency(us), 16.0
[CLEANUP], MaxLatency(us), 152703.0
[CLEANUP], 95thPercentileLatency(us), 152703.0
[CLEANUP], 99thPercentileLatency(us), 152703.0
[UPDATE], Operations, 6051.0
[UPDATE], AverageLatency(us), 570.6546025450339
[UPDATE], MinLatency(us), 263.0
[UPDATE], MaxLatency(us), 49055.0
[UPDATE], 95thPercentileLatency(us), 995.0
[UPDATE], 99thPercentileLatency(us), 3863.0
[UPDATE], Return=OK, 6051