Test/Output/run/workload a/hbase10_workloada_3000_run_020518.txt
[OVERALL], RunTime(ms), 6917.0
[OVERALL], Throughput(ops/sec), 433.71403787769265
[TOTAL_GCS_PS_Scavenge], Count, 5.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 43.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6216567876246928
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 5.0
[TOTAL_GC_TIME], Time(ms), 43.0
[TOTAL_GC_TIME_%], Time(%), 0.6216567876246928
[READ], Operations, 1424.0
[READ], AverageLatency(us), 1271.3370786516855
[READ], MinLatency(us), 259.0
[READ], MaxLatency(us), 880639.0
[READ], 95thPercentileLatency(us), 1498.0
[READ], 99thPercentileLatency(us), 4091.0
[READ], Return=OK, 1424
[CLEANUP], Operations, 2.0
[CLEANUP], AverageLatency(us), 746757.5
[CLEANUP], MinLatency(us), 11.0
[CLEANUP], MaxLatency(us), 1494015.0
[CLEANUP], 95thPercentileLatency(us), 1494015.0
[CLEANUP], 99thPercentileLatency(us), 1494015.0
[UPDATE], Operations, 1576.0
[UPDATE], AverageLatency(us), 1201.159263959391
[UPDATE], MinLatency(us), 373.0
[UPDATE], MaxLatency(us), 49983.0
[UPDATE], 95thPercentileLatency(us), 3865.0
[UPDATE], 99thPercentileLatency(us), 7903.0
[UPDATE], Return=OK, 1576