Test/Output/run/workload a/hbase10_workloada_6000_run_020518.txt
[OVERALL], RunTime(ms), 4984.0
[OVERALL], Throughput(ops/sec), 1203.852327447833
[TOTAL_GCS_PS_Scavenge], Count, 6.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 68.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 1.3643659711075442
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 6.0
[TOTAL_GC_TIME], Time(ms), 68.0
[TOTAL_GC_TIME_%], Time(%), 1.3643659711075442
[READ], Operations, 3009.0
[READ], AverageLatency(us), 491.58457959454967
[READ], MinLatency(us), 242.0
[READ], MaxLatency(us), 100095.0
[READ], 95thPercentileLatency(us), 732.0
[READ], 99thPercentileLatency(us), 3009.0
[READ], Return=OK, 3009
[CLEANUP], Operations, 2.0
[CLEANUP], AverageLatency(us), 85867.5
[CLEANUP], MinLatency(us), 23.0
[CLEANUP], MaxLatency(us), 171775.0
[CLEANUP], 95thPercentileLatency(us), 171775.0
[CLEANUP], 99thPercentileLatency(us), 171775.0
[UPDATE], Operations, 2991.0
[UPDATE], AverageLatency(us), 744.0615178869944
[UPDATE], MinLatency(us), 331.0
[UPDATE], MaxLatency(us), 47775.0
[UPDATE], 95thPercentileLatency(us), 1936.0
[UPDATE], 99thPercentileLatency(us), 5227.0
[UPDATE], Return=OK, 2991