Test/Output/run/workload a/hbase10_workloada_9000_run_020518.txt
[OVERALL], RunTime(ms), 6749.0
[OVERALL], Throughput(ops/sec), 1333.5308934656987
[TOTAL_GCS_PS_Scavenge], Count, 8.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 81.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 1.2001778041191287
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 8.0
[TOTAL_GC_TIME], Time(ms), 81.0
[TOTAL_GC_TIME_%], Time(%), 1.2001778041191287
[READ], Operations, 4490.0
[READ], AverageLatency(us), 417.75167037861917
[READ], MinLatency(us), 182.0
[READ], MaxLatency(us), 21279.0
[READ], 95thPercentileLatency(us), 592.0
[READ], 99thPercentileLatency(us), 2815.0
[READ], Return=OK, 4490
[CLEANUP], Operations, 2.0
[CLEANUP], AverageLatency(us), 63159.5
[CLEANUP], MinLatency(us), 15.0
[CLEANUP], MaxLatency(us), 126335.0
[CLEANUP], 95thPercentileLatency(us), 126335.0
[CLEANUP], 99thPercentileLatency(us), 126335.0
[UPDATE], Operations, 4510.0
[UPDATE], AverageLatency(us), 599.5623059866962
[UPDATE], MinLatency(us), 295.0
[UPDATE], MaxLatency(us), 114047.0
[UPDATE], 95thPercentileLatency(us), 1114.0
[UPDATE], 99thPercentileLatency(us), 3831.0
[UPDATE], Return=OK, 4510