Test/Output/run/workload a/jdbc_workloada_12000_run_020518.txt
Adding shard node URL: jdbc:mysql://localhost:3306/BenchTest
Using shards: 1, batchSize:-1, fetchSize: -1
[OVERALL], RunTime(ms), 75367.0
[OVERALL], Throughput(ops/sec), 159.22087916462112
[TOTAL_GCS_PS_Scavenge], Count, 3.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 29.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.03847837913145011
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 3.0
[TOTAL_GC_TIME], Time(ms), 29.0
[TOTAL_GC_TIME_%], Time(%), 0.03847837913145011
[UPDATE-FAILED], Operations, 5435.0
[UPDATE-FAILED], AverageLatency(us), 198.2329346826127
[UPDATE-FAILED], MinLatency(us), 112.0
[UPDATE-FAILED], MaxLatency(us), 10559.0
[UPDATE-FAILED], 95thPercentileLatency(us), 303.0
[UPDATE-FAILED], 99thPercentileLatency(us), 443.0
[READ], Operations, 698.0
[READ], AverageLatency(us), 205.98567335243553
[READ], MinLatency(us), 128.0
[READ], MaxLatency(us), 3475.0
[READ], 95thPercentileLatency(us), 323.0
[READ], 99thPercentileLatency(us), 401.0
[READ], Return=OK, 698
[READ], Return=NOT_FOUND, 5175
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 5286.0
[CLEANUP], MinLatency(us), 5284.0
[CLEANUP], MaxLatency(us), 5287.0
[CLEANUP], 95thPercentileLatency(us), 5287.0
[CLEANUP], 99thPercentileLatency(us), 5287.0
[UPDATE], Operations, 692.0
[UPDATE], AverageLatency(us), 104967.74566473988
[UPDATE], MinLatency(us), 9832.0
[UPDATE], MaxLatency(us), 2197503.0
[UPDATE], 95thPercentileLatency(us), 510975.0
[UPDATE], 99thPercentileLatency(us), 1637375.0
[UPDATE], Return=OK, 692
[UPDATE], Return=UNEXPECTED_STATE, 5435
[READ-FAILED], Operations, 5175.0
[READ-FAILED], AverageLatency(us), 186.712077294686
[READ-FAILED], MinLatency(us), 110.0
[READ-FAILED], MaxLatency(us), 5507.0
[READ-FAILED], 95thPercentileLatency(us), 299.0
[READ-FAILED], 99thPercentileLatency(us), 449.0