Test/Output/run/workload a/jdbc_workloada_3000_run_020518.txt
Adding shard node URL: jdbc:mysql://localhost:3306/BenchTest
Using shards: 1, batchSize:-1, fetchSize: -1
[OVERALL], RunTime(ms), 107449.0
[OVERALL], Throughput(ops/sec), 27.920222617241667
[TOTAL_GCS_PS_Scavenge], Count, 1.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 16.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.014890785395862223
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1.0
[TOTAL_GC_TIME], Time(ms), 16.0
[TOTAL_GC_TIME_%], Time(%), 0.014890785395862223
[UPDATE-FAILED], Operations, 991.0
[UPDATE-FAILED], AverageLatency(us), 353.1180625630676
[UPDATE-FAILED], MinLatency(us), 142.0
[UPDATE-FAILED], MaxLatency(us), 11775.0
[UPDATE-FAILED], 95thPercentileLatency(us), 630.0
[UPDATE-FAILED], 99thPercentileLatency(us), 2263.0
[READ], Operations, 485.0
[READ], AverageLatency(us), 341.16082474226806
[READ], MinLatency(us), 156.0
[READ], MaxLatency(us), 5407.0
[READ], 95thPercentileLatency(us), 581.0
[READ], 99thPercentileLatency(us), 2109.0
[READ], Return=OK, 485
[READ], Return=NOT_FOUND, 958
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 4410.0
[CLEANUP], MinLatency(us), 4408.0
[CLEANUP], MaxLatency(us), 4411.0
[CLEANUP], 95thPercentileLatency(us), 4411.0
[CLEANUP], 99thPercentileLatency(us), 4411.0
[UPDATE], Operations, 566.0
[UPDATE], AverageLatency(us), 187655.81625441698
[UPDATE], MinLatency(us), 13376.0
[UPDATE], MaxLatency(us), 4431871.0
[UPDATE], 95thPercentileLatency(us), 1115135.0
[UPDATE], 99thPercentileLatency(us), 2092031.0
[UPDATE], Return=OK, 566
[UPDATE], Return=UNEXPECTED_STATE, 991
[READ-FAILED], Operations, 958.0
[READ-FAILED], AverageLatency(us), 342.7578288100209
[READ-FAILED], MinLatency(us), 134.0
[READ-FAILED], MaxLatency(us), 17391.0
[READ-FAILED], 95thPercentileLatency(us), 620.0
[READ-FAILED], 99thPercentileLatency(us), 1965.0