Test/Output/run/workload a/jdbc_workloada_6000_run_020518.txt
Adding shard node URL: jdbc:mysql://localhost:3306/BenchTest
Using shards: 1, batchSize:-1, fetchSize: -1
[OVERALL], RunTime(ms), 29145.0
[OVERALL], Throughput(ops/sec), 205.8672156459084
[TOTAL_GCS_PS_Scavenge], Count, 2.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 27.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.09264024704065878
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 2.0
[TOTAL_GC_TIME], Time(ms), 27.0
[TOTAL_GC_TIME_%], Time(%), 0.09264024704065878
[UPDATE-FAILED], Operations, 2603.0
[UPDATE-FAILED], AverageLatency(us), 226.96696119861699
[UPDATE-FAILED], MinLatency(us), 119.0
[UPDATE-FAILED], MaxLatency(us), 12399.0
[UPDATE-FAILED], 95thPercentileLatency(us), 327.0
[UPDATE-FAILED], 99thPercentileLatency(us), 811.0
[READ], Operations, 421.0
[READ], AverageLatency(us), 236.22565320665083
[READ], MinLatency(us), 137.0
[READ], MaxLatency(us), 3967.0
[READ], 95thPercentileLatency(us), 342.0
[READ], 99thPercentileLatency(us), 793.0
[READ], Return=OK, 421
[READ], Return=NOT_FOUND, 2571
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 3283.0
[CLEANUP], MinLatency(us), 3282.0
[CLEANUP], MaxLatency(us), 3283.0
[CLEANUP], 95thPercentileLatency(us), 3283.0
[CLEANUP], 99thPercentileLatency(us), 3283.0
[UPDATE], Operations, 405.0
[UPDATE], AverageLatency(us), 67738.39012345679
[UPDATE], MinLatency(us), 5824.0
[UPDATE], MaxLatency(us), 1468415.0
[UPDATE], 95thPercentileLatency(us), 257407.0
[UPDATE], 99thPercentileLatency(us), 1003519.0
[UPDATE], Return=OK, 405
[UPDATE], Return=UNEXPECTED_STATE, 2603
[READ-FAILED], Operations, 2571.0
[READ-FAILED], AverageLatency(us), 225.04939712174252
[READ-FAILED], MinLatency(us), 115.0
[READ-FAILED], MaxLatency(us), 20303.0
[READ-FAILED], 95thPercentileLatency(us), 323.0
[READ-FAILED], 99thPercentileLatency(us), 740.0