Test/Output/run/workload a/jdbc_workloada_9000_run_020518.txt
Adding shard node URL: jdbc:mysql://localhost:3306/BenchTest
Using shards: 1, batchSize:-1, fetchSize: -1
[OVERALL], RunTime(ms), 80667.0
[OVERALL], Throughput(ops/sec), 111.56978690170702
[TOTAL_GCS_PS_Scavenge], Count, 2.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 31.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.03842959326614353
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 2.0
[TOTAL_GC_TIME], Time(ms), 31.0
[TOTAL_GC_TIME_%], Time(%), 0.03842959326614353
[UPDATE-FAILED], Operations, 3969.0
[UPDATE-FAILED], AverageLatency(us), 222.90879314688837
[UPDATE-FAILED], MinLatency(us), 113.0
[UPDATE-FAILED], MaxLatency(us), 9847.0
[UPDATE-FAILED], 95thPercentileLatency(us), 342.0
[UPDATE-FAILED], 99thPercentileLatency(us), 707.0
[READ], Operations, 486.0
[READ], AverageLatency(us), 224.33333333333334
[READ], MinLatency(us), 126.0
[READ], MaxLatency(us), 1147.0
[READ], 95thPercentileLatency(us), 357.0
[READ], 99thPercentileLatency(us), 705.0
[READ], Return=OK, 486
[READ], Return=NOT_FOUND, 4011
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 4566.0
[CLEANUP], MinLatency(us), 4564.0
[CLEANUP], MaxLatency(us), 4567.0
[CLEANUP], 95thPercentileLatency(us), 4567.0
[CLEANUP], 99thPercentileLatency(us), 4567.0
[UPDATE], Operations, 534.0
[UPDATE], AverageLatency(us), 146580.7415730337
[UPDATE], MinLatency(us), 9072.0
[UPDATE], MaxLatency(us), 6160383.0
[UPDATE], 95thPercentileLatency(us), 651775.0
[UPDATE], 99thPercentileLatency(us), 2009087.0
[UPDATE], Return=OK, 534
[UPDATE], Return=UNEXPECTED_STATE, 3969
[READ-FAILED], Operations, 4011.0
[READ-FAILED], AverageLatency(us), 226.6195462478185
[READ-FAILED], MinLatency(us), 110.0
[READ-FAILED], MaxLatency(us), 22703.0
[READ-FAILED], 95thPercentileLatency(us), 327.0
[READ-FAILED], 99thPercentileLatency(us), 792.0